[
   {
      "date":"2015-07-25",
      "explanation":"The Trifid Nebula, also known as Messier 20, is easy to find with a small telescope, a well known stop in the nebula rich constellation Sagittarius. But where visible light pictures show the nebula divided into three parts by dark, obscuring dust lanes, this penetrating infrared image reveals filaments of glowing dust clouds and newborn stars. The spectacular false-color view is courtesy of the Spitzer Space Telescope. Astronomers have used the Spitzer infrared image data to count newborn and embryonic stars which otherwise can lie hidden in the natal dust and gas clouds of this intriguing stellar nursery. As seen here, the Trifid is about 30 light-years across and lies only 5,500 light-years away.",
      "hdurl":"https://apod.nasa.gov/apod/image/1507/trifid_spitzerR.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Infrared Trifid",
      "url":"https://apod.nasa.gov/apod/image/1507/trifid_spitzerR1024.jpg"
   },
   {
      "copyright":"Serge Brunier",
      "date":"2005-10-04",
      "explanation":"The disk of our Milky Way Galaxy is home to hot nebulae, cold dust, and billions of stars.  This disk can be seen from a dark location on Earth as a band of diffuse light across the sky.  This band crosses the sky in dramatic fashion in the above series of wide angle sky exposures from Chile.   The deepness of the exposures also brings to light a vast network of complex dust filaments.  Dust is so plentiful that it obscures our Galaxy's center in visible light, hiding its true direction until discovered by other means early last century.  The Galactic Center, though, is visible above as the thickest part of the disk.  The diffuse glow comes from billions of older, fainter stars like our Sun, which are typically much older than the dust or any of the nebulae.  One particularly photogenic area of darkness is the Pipe Nebula visible above the Galactic Center.  Dark dust is not the dark matter than dominates our Galaxy -- that dark matter remains in a form yet unknown.",
      "hdurl":"https://apod.nasa.gov/apod/image/0510/allskymilkyway_brunier_big.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"The Milky Way in Stars and Dust",
      "url":"https://apod.nasa.gov/apod/image/0510/allskymilkyway_brunier.jpg"
   },
   {
      "date":"2020-08-14",
      "explanation":"Why is this nebula so complex? When a star like our Sun is dying, it will cast off its outer layers, usually into a simple overall shape. Sometimes this shape is a sphere, sometimes a double lobe, and sometimes a ring or a helix.  In the case of planetary nebula NGC 5189, however, besides an overall \"Z\" shape (the featured image is flipped horizontally and so appears as an \"S\"), no such simple structure has emerged.  To help find out why, the Earth-orbiting Hubble Space Telescope has observed NGC 5189 in great detail. Previous findings indicated the existence of multiple epochs of material outflow, including a recent one that created a bright but distorted torus running horizontally across image center.  Hubble results appear consistent with a hypothesis that the dying star is part of a binary star system with a precessing symmetry axis. NGC 5189 spans about three light years and lies about 3,000 light years away toward the southern constellation of the Fly (Musca).",
      "hdurl":"https://apod.nasa.gov/apod/image/2008/NGC5189_HubbleVargas_4039.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"NGC 5189: An Unusually Complex Planetary Nebula",
      "url":"https://apod.nasa.gov/apod/image/2008/NGC5189_HubbleVargas_960.jpg"
   },
   {
      "date":"2001-01-17",
      "explanation":"Why is NGC 3310 bursting with young stars?  The brightest of these new stars are so hot that they light up this spiral galaxy not only in blue light, but in light so blue humans can't see it: ultraviolet.  The Hubble Space Telescope took the above photograph in different bands of ultraviolet light.  Speculation holds that NGC 3310 collided with one of its own dwarf companion galaxies only about 50 million years previously.  This merger sent density waves rippling around the spiral disk, causing many gas clouds to condense into star forming regions.  Imaging nearby galaxies in ultraviolet light allows astronomers to better understand the images of distant highly redshifted galaxies in visible light, and so to understand why many of these distant galaxies appear relatively fragmented.  The unusually smooth NGC 3310 spans over 20 thousand light years and lies about 50 million light years away towards the constellation of Ursa Major.",
      "hdurl":"https://apod.nasa.gov/apod/image/0101/ngc3310_hst_big.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Spiral Galaxy NGC 3310 in Ultraviolet",
      "url":"https://apod.nasa.gov/apod/image/0101/ngc3310_hst.jpg"
   },
   {
      "copyright":"Mike Salway",
      "date":"2007-03-29",
      "explanation":"South is toward the top in this frame from a stunning movie featuring Jupiter and moons recorded last Thursday from the Central Coast of New South Wales, Australia. In fact, three jovian moons and two red spots are ultimately seen in the full video as they glide around the solar system's ruling gas giant. In the early frame above, Ganymede, the largest moon in the solar system, is off the lower right limb of the planet, while intriguing Europa is visible against Jupiter's cloud tops, also near the lower right. Jupiter's new red spot junior is just above the broad white band in the planet's southern (upper) hemisphere. In later frames, as planet and moons rotate (right to left), red spot junior moves behind Jupiter's left edge while the Great Red Spot itself comes into view from the right. Also finally erupting into view at the right, is Jupiter's volcanic moon, Io. To download the full 2 megabyte movie as an animated gif file, click on the picture.",
      "hdurl":"https://apod.nasa.gov/apod/image/0703/20070323-jupiter_anim.gif",
      "media_type":"image",
      "service_version":"v1",
      "title":"Jupiter Moon Movie",
      "url":"https://apod.nasa.gov/apod/image/0703/jupiterAnim_salway.jpg"
   },
   {
      "date":"2011-06-28",
      "explanation":"An expansive nebula of dust is seen to surround red supergiant star Betegeuse in this remarkable high resolution composite, an infrared VLT image from the European Southern Observatory. Betelgeuse itself is outlined by the small, central red circle. If found in our own solar system its diameter would almost encompass the orbit of Jupiter. But the larger envelope of circumstellar dust extends some 60 billion kilometers into space, equivalent to about 400 times the Earth-Sun distance. The dust is likely formed as the swollen atmosphere of the supergiant sheds material into space, a final phase in the evolution of a massive star. Mixing with the interstellar medium, the dust could ultimately form rocky terrestrial planets like Earth. The central bright portion of the outer image has been masked to reveal fainter extended structures. The field of view is 5.63 arcseconds across.",
      "hdurl":"https://apod.nasa.gov/apod/image/1106/BetelgeuseCircumstellar_esoFull.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Stardust and Betelgeuse",
      "url":"https://apod.nasa.gov/apod/image/1106/BetelgeuseCircumstellar_eso900.jpg"
   },
   {
      "date":"1997-03-22",
      "explanation":"The Sleeping Beauty galaxy\r may appear peaceful at first sight but it is actually tossing\r and turning. In an unexpected twist, recent observations have\r shown that the center of this photogenic galaxy\r is rotating in the opposite direction than the outer regions!\r Stranger still - there is a middle region where the stars rotate\r in the opposite direction from the surrounding dust\r and gas.\r The fascinating internal motions of M64,\r also cataloged as NGC 4826, are thought to be the result of a\r collision between a small galaxy\r and a large galaxy - where the resultant\r mix has not yet settled down.\r",
      "hdurl":"https://apod.nasa.gov/apod/image/m64_keel.gif",
      "media_type":"image",
      "service_version":"v1",
      "title":"M64: The Sleeping Beauty Galaxy \r\nCredit:",
      "url":"https://apod.nasa.gov/apod/image/m64_keel.gif"
   },
   {
      "copyright":"Martin Pugh",
      "date":"2013-11-14",
      "explanation":"gmatic spiral galaxy NGC 1097 shines in southern skies, about 45 million light-years away in the chemical constellation Fornax. Its blue spiral arms are mottled with pinkish star forming regions in this colorful galaxy portrait. They seem to have wrapped around a small companion galaxy below and left of center, about 40,000 light-years from the spiral's luminous core. That's not NGC 1097's most peculiar feature, though. The very deep exposure hints of faint, mysterious jets, most easily seen to extend well beyond the bluish arms toward the lower right. In fact, four faint jets are ultimately recognized in optical images of NGC 1097. The jets trace an X centered on the galaxy's nucleus, but probably don't originate there. Instead, they could be fossil star streams, trails left over from the capture and disruption of a much smaller galaxy in the large spiral's ancient past. A Seyfert galaxy, NGC 1097's nucleus also harbors a supermassive black hole.",
      "hdurl":"https://apod.nasa.gov/apod/image/1311/NGC1097HaLRGBpugh.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"The Jets of NGC 1097",
      "url":"https://apod.nasa.gov/apod/image/1311/NGC1097HaLRGBpugh950.jpg"
   },
   {
      "copyright":"Kwon, O Chul",
      "date":"2011-03-25",
      "explanation":"Intense auroral activity flooded the night with shimmering colors on February 24, captured here from a lodge near the city of Yellowknife in northern Canada. The stunning sequence (left to right) of three all-sky exposures, taken at 30 second intervals, shows rapid changes in dancing curtains of northern lights against a starry background. What makes the northern lights dance? Measurements by NASA's fleet of THEMIS spacecraft indicate that these explosions of auroral activity are driven by sudden releases of energy in the Earth's magnetosphere called magnetic reconnection events. The reconnection events release energy when magnetic field lines snap like rubber bands, driving charged particles into the upper atmosphere. Stretching into space, these reconnection events occur in the magnetosphere on the Earth's night side at a distance about 1/3 of the way to the Moon.",
      "hdurl":"https://apod.nasa.gov/apod/image/1103/aurora_h3kwon.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Auroral Substorm over Yellowknife",
      "url":"https://apod.nasa.gov/apod/image/1103/aurora_h3kwon_600.jpg"
   },
   {
      "date":"2017-01-31",
      "explanation":"Are you planning to see the American Eclipse on August 21? A few hours after sunrise, a rare total eclipse of the Sun will be visible along a narrow path across the USA. Those only near the path will see a partial eclipse.  Although some Americans live right in path of totality, surely many more will be able to get there after a well-planned drive.  One problem with eclipses, though, is that clouds sometimes get in the way.  To increase your clear-viewing odds, you might consult the featured map and find a convenient destination with a historically low chance (more blue) of thick clouds overhead during totality. Given the large fraction of Americans carrying camera-equipped smartphones, this American Eclipse may turn out to be the most photographed event in the history of the world.   Socialize: Plan an eclipse party!",
      "hdurl":"https://apod.nasa.gov/apod/image/1701/EclipseClouds_MODISanderson_1415.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Where to See the American Eclipse",
      "url":"https://apod.nasa.gov/apod/image/1701/EclipseClouds_MODISanderson_1080.jpg"
   },
   {
      "copyright":"Ralf Rohner",
      "date":"2018-09-22",
      "explanation":"On the August 18 night flight from San Francisco to Zurich, a window seat offered this tantalizing view when curtains of light draped a colorful glow across the sky over Hudson Bay. Constructed by digitally stacking six short exposures made with a hand held camera, the scene records the shimmering aurora borealis or northern lights just as the approaching high altitude sunrise illuminated the northeastern horizon. It also caught the flash of a Perseid meteor streaking beneath the handle stars of the Big Dipper of the north. A few days past the meteor shower's peak, its trail still points across the sky toward Perseus. Beautiful aurorae and shower meteors both occur in Earth's upper atmosphere at altitudes of 100 kilometers or so, far above commercial airline flights. The aurora are caused by energetic charged particles from the magnetosphere, while meteors are trails of comet dust.",
      "hdurl":"https://apod.nasa.gov/apod/image/1809/CurtainsofLightRohner.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Window Seat over Hudson Bay",
      "url":"https://apod.nasa.gov/apod/image/1809/CurtainsofLightRohner1024.jpg"
   },
   {
      "copyright":"Joe Randall",
      "date":"2020-09-27",
      "explanation":"Have you ever watched a lightning storm in awe?  Join the crowd. Oddly, details about how lightning is produced remains a topic of research. What is known is that updrafts carry light ice crystals into collisions with larger and softer ice balls, causing the smaller crystals to become positively charged.  After enough charge becomes separated, the rapid electrical discharge that is lightning occurs. Lightning usually takes a jagged course, rapidly heating a thin column of air to about three times the surface temperature of the Sun.  The resulting shock wave starts supersonically and decays into the loud sound known as thunder.  Lightning bolts are common in clouds during rainstorms, and on average 44 lightning bolts occur on the  Earth every second. Pictured, over 60 images were stacked to capture the flow of lightning-producing storm clouds in July over Colorado Springs, Colorado, USA.    Follow APOD in English on: Facebook,  Instagram, or Twitter",
      "hdurl":"https://apod.nasa.gov/apod/image/2009/LightningStorm_Randall_5184.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Lightning over Colorado",
      "url":"https://apod.nasa.gov/apod/image/2009/LightningStorm_Randall_1080.jpg"
   },
   {
      "copyright":"T. Rector",
      "date":"2007-03-21",
      "explanation":"It may look to some like a duck, but it lays stars instead of eggs.  In the center of the above image lies Barnard 163, a nebula of molecular gas and dust so thick that visible light can't shine through it.   With a wing span measured in light years, Barnard 163's insides are surely colder than its exterior, allowing conditions where gas can clump and eventually form stars.  Barnard 163 lies about 3,000 light years from Earth toward the constellation of Cepheus the King. The red glow in the background results from IC 1396, a large emission nebula that houses the Elephant's Trunk Nebula.  Finding Barnard 163 in an image of its greater emission nebula IC 1396 can be a challenge, but it's possible.    News: Night and Day are Equal: Today is an Equinox",
      "hdurl":"https://apod.nasa.gov/apod/image/0703/barnard163_noao_big.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Molecular Cloud Barnard 163",
      "url":"https://apod.nasa.gov/apod/image/0703/barnard163_noao.jpg"
   },
   {
      "date":"1997-06-15",
      "explanation":"Robert H. Goddard, one of the founding fathers of modern rocketry, was born in Worcester Massachusetts in 1882. As a 16 year old, Goddard read H.G. Wells' science fiction classic \"War Of The Worlds\" and dreamed of spaceflight. By 1926 he had designed, built, and launched the world's first liquid fuel rocket. During his career he was ridiculed by the press for suggesting that rockets could be flown to the Moon, but he kept up his experiments in rocketry supported in part by the Smithsonian Institution and championed by Charles Lindbergh. Pictured above in 1937 in the desert near Roswell, New Mexico, Goddard examines a nose cone and parachute from one of his test rockets. Widely recognized as a gifted experimenter and engineering genius, his rockets were many years ahead of their time. He died in 1945 holding over 200 patents in rocket technology. A liquid fuel rocket constructed on principles developed by Goddard landed humans on the Moon in 1969.",
      "hdurl":"https://apod.nasa.gov/apod/image/goddard1.gif",
      "media_type":"image",
      "service_version":"v1",
      "title":"Rockets and Robert Goddard",
      "url":"https://apod.nasa.gov/apod/image/goddard1.gif"
   },
   {
      "copyright":"Joe Orman",
      "date":"1999-08-23",
      "explanation":"What if you woke up one morning and saw more than one Sun in the sky?  Most probably, you would be seeing sundogs, extra-images of the Sun created by falling ice-crystals in the Earth's atmosphere.  As water freezes in the atmosphere, small, flat, six-sided, ice crystals might be formed.  As these crystals flutter to the ground, much time is spent with their faces flat, parallel to the ground.  An observer may pass through the same plane as many of the falling ice crystals near sunrise or sunset.  During this alignment, each crystal can act like a miniature lens, refracting sunlight into our view and creating parhelia, the technical term for sundogs.  Sundogs were photographed here",
      "hdurl":"https://apod.nasa.gov/apod/image/9908/sundogsvla_orman_big.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Sundogs over the VLA",
      "url":"https://apod.nasa.gov/apod/image/9908/sundogsvla_orman.jpg"
   },
   {
      "copyright":"Laubing",
      "date":"2019-01-31",
      "explanation":"Blown by fast winds from a hot, massive star, this cosmic bubble is huge. Cataloged as Sharpless 2-308 it lies some 5,200 light-years away toward the constellation of the Big Dog (Canis Major) and covers slightly more of the sky than a Full Moon. That corresponds to a diameter of 60 light-years at its estimated distance. The massive star that created the bubble, a Wolf-Rayet star, is the bright one near the center of the nebula. Wolf-Rayet stars have over 20 times the mass of the Sun and are thought to be in a brief, pre-supernova phase of massive star evolution. Fast winds from this Wolf-Rayet star create the bubble-shaped nebula as they sweep up slower moving material from an earlier phase of evolution. The windblown nebula has an age of about 70,000 years. Relatively faint emission captured in the expansive image is dominated by the glow of ionized oxygen atoms mapped to a blue hue. SH2-308 is also known as The Dolphin Nebula.",
      "hdurl":"https://apod.nasa.gov/apod/image/1901/SH2-308Laubing2048.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Sharpless 308: Star Bubble",
      "url":"https://apod.nasa.gov/apod/image/1901/SH2-308Laubing1024.jpg"
   },
   {
      "copyright":"CHART32 Team",
      "date":"2016-03-24",
      "explanation":"Scanning the skies for galaxies, Canadian astronomer Paul Hickson and colleagues identified some 100 compact groups of galaxies, now appropriately called Hickson Compact Groups (HCGs). This sharp telescopic image captures one such galaxy group, HCG 91, in beautiful detail. The group's three colorful spiral galaxies at the center of the field of view are locked in a gravitational tug of war, their interactions producing faint but visible tidal tails over 100,000 light-years long. Their close encounters trigger furious star formation. On a cosmic timescale the result will be a merger into a large single galaxy, a process now understood to be a normal part of the evolution of galaxies, including our own Milky Way. HCG 91 lies about 320 million light-years away in the constellation Piscis Austrinus. But the impressively deep image also catches evidence of fainter tidal tails and galaxy interactions close to 2 billion light-years distant.",
      "hdurl":"https://apod.nasa.gov/apod/image/1603/NGC7214_70.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"Hickson 91 in Piscis Austrinus",
      "url":"https://apod.nasa.gov/apod/image/1603/NGC7214_70_1024c.jpg"
   },
   {
      "date":"2002-01-02",
      "explanation":"High above a cloudy Earth, the International Space Station (ISS) orbits silently.  The Space Shuttle Endeavor Crew took the above picture as they departed the space station in mid-December.  Endeavor brought up three new astronauts to occupy the ISS and carried home the members of Expedition Three, a trio that has been housed in the ISS since August.  Highlights of this Endeavor mission included fixing a solar panel and maneuvering the station to avoid a large piece of passing space junk.  Visible in the above picture are the space station's robot manipulator arm as well as several modules and solar arrays.",
      "hdurl":"https://apod.nasa.gov/apod/image/0201/iss_sts108_big.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"International Space Station Over Earth",
      "url":"https://apod.nasa.gov/apod/image/0201/iss_sts108.jpg"
   },
   {
      "date":"2020-01-11",
      "explanation":"Near the outskirts of the Small Magellanic Cloud, a satellite galaxy some 200 thousand light-years distant, lies 5 million year young star cluster NGC 602. Surrounded by natal gas and dust, NGC 602 is featured in this stunning Hubble image of the region, augmented by images in the X-ray by Chandra,  and in the infrared by Spitzer. Fantastic ridges and swept back shapes strongly suggest that energetic radiation and shock waves from NGC 602's massive young stars have eroded the dusty material and triggered a progression of star formation moving away from the cluster's center. At the estimated distance of the Small Magellanic Cloud, the Picture spans about 200 light-years, but a tantalizing assortment of background galaxies are also visible in this sharp multi-colored view. The background galaxies are hundreds of millions of light-years or more beyond NGC 602.",
      "hdurl":"https://apod.nasa.gov/apod/image/2001/ngc602_ChandraHubbleSpitzer_3600.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"NGC 602 and Beyond",
      "url":"https://apod.nasa.gov/apod/image/2001/ngc602_ChandraHubbleSpitzer_960.jpg"
   },
   {
      "copyright":"Martin Pugh",
      "date":"2021-07-15",
      "explanation":"In silhouette against a crowded star field along the tail of the arachnalogical constellation Scorpius, this dusty cosmic cloud evokes for some the image of an ominous dark tower. In fact, clumps of dust and molecular gas collapsing to form stars may well lurk within the dark nebula, a structure that spans almost 40 light-years across this gorgeous telescopic portrait. Known as a cometary globule, the swept-back cloud, is shaped by intense ultraviolet radiation from the OB association of very hot stars in NGC 6231, off the upper edge of the scene. That energetic ultraviolet light also powers the globule's bordering reddish glow of hydrogen gas. Hot stars embedded in the dust can be seen as bluish reflection nebulae. This dark tower, NGC 6231, and associated nebulae are about 5,000 light-years away.",
      "hdurl":"https://apod.nasa.gov/apod/image/2107/Dark_Tower_MPRS.jpg",
      "media_type":"image",
      "service_version":"v1",
      "title":"The Dark Tower in Scorpius",
      "url":"https://apod.nasa.gov/apod/image/2107/Dark_Tower_MPRS_1100c.jpg"
   }
]
